{
    "title": "Space Pirates",
    "genre": "Shoot 'em up",
    "tap": "6+",
    "esrp": "E",
    "summary": "You are a space pirate who has to successfully travel planet to planet while fighting off enemy ships. Each ship you destroy you get their loot and your score goes up.",
    "ui": "The color scheme and design that I chose for my UI fits my game design because it uses pretty commonly used colors for the items across other games. Such as the health, health can refer to blood so an easy color to remember is red. Shield is a distinct item that protects you from being damaged so I gave it a pretty distinct color of purple. And the lasers that are being fired from the weapons I made blue because they would be easy to see. The reason that I chose the red text throughout the credits and the title is because it is a nice vibrant color that contrasts nicely with the background in both scenes. I also chose to use white for the score counter and timer for this reason since space is a much darker background it needed a much lighter color to easily distinguish.",
    "assets": {
        "enemyLaser": "Sci-Fi Sounds (1.0) Created/distributed by Kenney (www.kenney.nl) Creation date: 11-10-2020",
        "titleMusic": "https://mixkit.co/free-stock-music/",
        "pickupSound": "RPG Audio by  Kenney Vleugels (Kenney.nl)",
        "explosion": "Sci-Fi Sounds (1.0) Created/distributed by Kenney (www.kenney.nl) Creation date: 11-10-2020",
        "components": "Camera, Particle System x2 (Thrusters)",
        "scripts": "InputHandler.js (Movement) - Using the this.app.keyboard.isPressed method to check for A and D inputs on the keyboard. Movement left or right uses the this.entity.translate method to move the ship left or right. Particle systems use linear velocity to emit them backward and switch color from red to yellow to black."
    },
    "art": {
        "ui": "The UI consists of six elements those are the watermark, timer, score, health, shield, and ammo. I chose to seperate the different elements based on their groups, I left all of the important information at the bottom such as the ships health, shield, and ammo, and I left the watermark, timer, and score counter at the top so it is all organized."
    },
    "story": {
        "exposition": "You are an adventurer who travels by ship from planet to planet doing quests and trading items.",
        "ii": "The space pirate “Saw” spotted your ship and the items you’ve acquired in your travels and wants to steal them. The player narrowly escapes.",
        "ra": " The character can no longer quest knowing that Saw and his team of pirates are in pursuit. So the player must quest to find Saw first, defeating his army of space pirates along the way.",
        "climax": "When the player finally reaches Saw, they must defeat his ship that is made up of powerful parts from other ships he has stolen in his travels. When his health is low, he turns on his boosters and runs away!",
        "fa": "This means the player will need to continue defeating enemies while pursuing the antagonist. The player starts earning powerups to upgrade their ship before finally catching up to the boss again, this time to defeat him.",
        "res": "After defeating Saw, the player returns to the nearest planet a hero, with the entire planet watching what had unfolded. They no longer need to worry about Saw and his pirate army stealing from them"
    },
    "controls": {
        "forwards": "W",
        "backwards": "S",
        "left": "A",
        "right": "D",
        "shoot": "Space"
    },
    "scenes": {
        "mainMenu": "Intro to the game shows the options and allows interaction between different scenes. I added a SSAO effect to the camera which darkens the scene and adds a gloomy effect that really pushes the mood of the scene.",
        "level1": "The first level of the game included multiple enemies, a score counter, and a timer. The camera at this level also has an FXAA post-processing effect. This effect smooths the scene and pulls all the elements together to provide a clean natural look.",
        "credits": "Shows all of the game credits"
    },
    "mda": {
        "difficuly": "Average",
        "game-flow": "The first three levels of the game will introduce the basic functions of the player's aircraft and guide players how to progress to future levels. Starting at level five and every five levels after that the player will encounter a boss that is unique and use their learned skills to defeat the boss. If the player cannot take on the boss they need to go back and repeat the previous levels to gain the apt powerups in order to effecively attack the boss."
    },
    "roadmap": {
        "post-effects": "I plan on adjusting the effects I already have in my levels to make them fit the scene more and pull everything together. I also plan to look at some of the blending effects to try and create a super smooth look that pulls all the edges and elements together correctly."
    },
    "changelog": {
        "v.1.3.0": "Adjusted the UI elements in the level one scene to make it look more aesthetically pleasing. This included rearranging where all of the elements are positioned except for the timer and the score, those elements were only adjusted to look more balanced. (All prior versions are compiled into this one version log, change logs were added 4/10/2024).",
        "v.1.3.2": "Implemented a character introduction scene to introduce the enemy and the hero. Adjusted the placements and the background of the intro scene to provide an immersive experience. Designed an ammo power up and a shield powerup and added them to the testing scene of the game.",
        "v.1.3.3": "Added transtions between the dialouge and added two new dialouge messages."
    },
    "comments": {
        "v.1.3.2": "Working on this version for the game I had to use a 3d modeling software called tinkercad to make some of the assets. While using the software I discovered that it is very easy to add objects to the environment and tweak them any way you see fit as well as changing the color of the objects and editing the objects themselves. I would like to learn more about the alignment system in tinkercad, I had a semi-difficult time attempting to align some of the assets with each other. Nonetheless I plan to continue using the software and maybe even designing some more assets such as buildings or meteors."
    }
}